Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/separation_and_divorce/presumption_of_paternity.html.txt.tmx
Source language: en
Languages: ga

source: The rules governing the presumption of paternity may have an effect when a child is claiming an inheritance or maintenance
ga: D’fhéadfadh na rialacha a rialaíonn toimhde atharthachta tionchar a imirt nuair a bhíonn oidhreacht nó cothabháil á éileamh ag leanbh

source: The children of parents who are married to each other are presumed in law to be the child of their mother's husband
ga: Meastar sa dlí gurb iad leanaí fhear céile a máthar atá i leanaí tuismitheoirí atá pósta lena chéile

source: Section 88 of the Children and Family Relationships Act 2015 amended the Status of Children Act 1987 so that the presumption that a woman’s husband is the father of the child no longer applies if the child is born more than 10 months after they separated
ga: Is é an tAcht um Stádas Leanaí 1987 arna leasú ag Alt 88 d'Acht Leanaí agus Caidrimh Teaghlaigh 2015 ionas go mbeidh an toimhde go bhfuil an fear céile ar bhean a bheidh an t-athair an linbh a thuilleadh má tá an leanbh a rugadh níos mó ná 10 mhí tar éis scartha siad

source: The children of parents who are not married to each other may have to prove paternity in order to get their maintenance or inheritance entitlements
ga: D’fhéadfadh go mbeadh ar leanaí tuismitheoirí nach bhfuil pósta lena chéile atharthacht a chruthú chun a dteidlíochtaí cothabhála nó oidhreachta a fháil

source: This isn't necessary if the father acknowledges paternity or is named as the child's father on the birth certificate
ga: Níl seo riachtanach má aithníonn an t-athair atharthacht nó má ainmnítear é mar athair an linbh ar an teastas breithe

source: If he acknowledges paternity, he can agree to have his name added to the birth certificate at a later date
ga: Má aithníonn sé atharthacht, féadfaidh sé a chomhaontú go gcuirfear a ainm leis an teastas breithe ag dáta níos déanaí

source: If the alleged father disputes paternity, he may agree to a medical paternity test
ga: Má dhéanann an t-athair líomhnaithe agóid i gcoinne atharthachta, féadfaidh sé a chomhaontú chun tabhairt faoi thástáil atharthachta

source: If he doesn't agree to this, it is up to the court (usually the District Court) to decide on paternity
ga: Mura gcomhaontaíonn sé leis seo a dhéanamh, is faoin gcúirt (de ghnáth an Cúirt Dúiche) atá sé chun cinneadh a dhéanamh ar atharthacht

source: Where someone refuses to give a sample, the court can draw whatever conclusions it thinks proper from the refusal
ga: Sa chás go ndiúltaíonn duine éigin chun sampla a thabhairt, féadfaidh an chúirt pé conclúid a chruthú má mheasann siad gur cuí, ón diúltú

source: For example, if the alleged father refused to give a sample, the court may take the view that he was afraid the tests would indicate he was the father
ga: Mar shampla, má dhiúltaigh an t-athair líomhnaithe chun sampla a thabhairt, féadfaidh an chúirt an tuairim a chruthú go raibh eagla air go dtabharfadh na tástálacha le fios gurb eisean an t-athair

source: If the mother refused to give a sample, the court may take the view she was afraid the test may prove the named man was not the father
ga: Má dhiúltaigh an mháthair chun sampla a thabhairt, féadfaidh an chúirt an tuairim a chruthú go raibh eagla uirthi go dtabharfadh an tástáil le fios nárbh é an fear a ainmnítear an t-athair

source: Appeals from the District Court are heard in the Circuit Court
ga: Éistear le hachomhairc ón gCúirt Dúiche sa Chúirt Chuarda

source: Paternity testing is carried out using blood, hair or swabs from the mouth
ga: Tá tástáil atharthachta gcrích ag baint úsáide fuil, fionnadh nó táithíní ó bhéal

source: You can either contact the laboratory yourself (they will ask you to select a GP to undertake the tests), or you can go to one of the specialist agencies that will organise the test for you
ga: Féadfaidh tú teagmháil a dhéanamh leis an tsaotharlann (iarrfaidh siad ort LG a roghnú chun tabhairt faoi na tástálacha), nó féadfaidh tú dul chuig ceann de na gníomhaireachtaí speisialtóra in Éirinn a eagróidh an tástáil duit

source: It is important to be aware, that you cannot use the test results to have the father's name placed on the birth certificate without his consent
ga: Is tábhachtach a bheith ar an eolas nach féidir leat torthaí na tástála a úsáid chun ainm an athar a chur ar an teastas breithe gan a thoiliú a fháil

source: If a father wants to carry out a paternity test to establish legal paternity in order that it would stand up in court, then all 3 parties (mother, father, child) would need to be tested, so the mother would have to agree to this test
ga: Más mian le hathair tabhairt faoi thástáil atharthachta lena atharthacht dhlíthiúil a dheimhniú go seasfaí leis an atharthacht sa chúirt, ba ghá tástáil a dhéanamh ar na 3 pháirtí go léir (máthair, athair, leanbh), agus bheadh ar an máthair comhaontú leis an tástáil seo

source: Children must be 3 months old before blood testing can be undertaking for paternity testing purposes
ga: Ní mór go bhfuil leanaí 3 mhí d’aois sular féidir tabhairt faoi thástáil fola ar mhaithe le cuspóirí tástála atharthachta

source: However, a mouth swab of the child can be taken from birth and used for the test
ga: Féadtar maipín béil a ghlacadh ón leanbh ar shaolú dó/di a úsáid don tástáil

source: For identification purposes, photos are required of those giving samples
ga: Ar mhaithe le cuspóirí sainaitheanta, teastaíonn grianghraif díobh siúd a thugann na samplaí

source: A person or persons may apply to the Circuit Court for a declaration stating that they are or are not the father, mother or parents of a child
ga: Is féidir le duine nó daoine a iarraidh ar an gCúirt Chuarda ar dhearbhú á rá go bhfuil siad nó nach bhfuil siad an t-athair, máthair nó tuismitheoirí linbh

source: Similarly, a child (as an adult) can apply for a declaration stating that a person or persons named is or is not their father, mother or parents
ga: Mar an gcéanna, is féidir le leanbh (mar dhuine fásta) iarratas a dhéanamh ar dhearbhú ag rá go bhfuil nó nach bhfuil duine nó daoine a bheidh ainmnithe a n-athair, máthair nó tuismitheoirí

source: Costs of paternity testing vary, depending on the type of test selected
ga: Is éagsúil a bhíonn costais tástála atharthachta, ag brath ar shaghas na tástála a roghnaítear

source: (The most common methods of testing are a blood test, or oral (mouth) swab for the mother, father and child)
ga: (Tástáil fola, nó maipín béil don mháthair, athair agus don leanbh iad na modhanna is coitianta tástála)

source: Paternity testing is not part of the public health system and you will have to pay for any tests conducted
ga: Níl tástáil atharthachta mar chuid den chóras sláinte poiblí agus beidh ort íoc as aon tástálacha faoina dtugtar

source: Depending on the circumstances of the individuals involved, the court may make an order for costs, and the parent(s) may be required to make a contribution to the overall cost
ga: Ag brath ar chúinsí na ndaoine aonair atá i gceist, féadfaidh an chúirt ordú do chostais a dhéanamh, agus b’fhéidir go mbeidh ar an tuismitheoir/na tuismitheoirí ranníocaíocht a dhéanamh leis an gcostas foriomlán

source: Further information on paternity testing (including a list of laboratories and specialist agencies) is available from Treoir
ga: Tá fáil ar thuilleadh faisnéise ar thástáil atharthachta (lena n-áirítear liosta saotharlann agus gníomhaireachtaí speisialtóra) ó Treoir

source: You can download their leaflet on Establishing Paternity/DNA Testing (pdf) here
ga: Féadfaidh tú a mbileog a íoslódáil ar Atharthacht a Dheimhniú/Tástáil DNA (pdf) anseo

source: If you wish to have a paternity test conducted yourself, you should contact the laboratory (they will ask you to select a GP to undertake the tests), or you can go to one of the specialist agencies that will organise the test for you
ga: Más mian leat go dtabharfar faoi thástáil atharthachta, ba cheart duit teagmháil a dhéanamh leis an tsaotharlann (iarrfaidh siad ort LG a roghnú chun tabhairt faoi na tástálacha), nó féadfaidh tú dul chuig ceann de na gníomhaireachtaí speisialtóra in Éirinn a eagróidh an tástáil duit

source: Information on applying to court is available on the Courts Service website
ga: Tá eolas ar chur i bhfeidhm chun na cúirte le fáil ar láithreán gréasáin na Seirbhíse Cúirteanna
